{
  "title": "bean enchiladas",
  "slug": "bean-enchiladas",
  "servings": "4",
  "tags": ["Mains"],
  "image": "/images/enchiladas.svg",
  "ingredients": [
    {
      "ingredient": "½ batch of bean mix",
      "link": "bean-mix"
    },
    {
      "ingredient": "6-7 tortillas",
      "context": "(Size 8 inch/22cm or ~40g per wrap)"
    },
    {
      "ingredient": "Grated cheese",
      "context": "(For sprinkling on top)"
    }
  ],
  "ingredientGroups": [
    {
      "groupTitle": "Enchilada Sauce",
      "ingredients": [
        {
          "ingredient": "Splash oil"
        },
        {
          "ingredient": "1 tablespoon Mexican spice mix ",
          "context": "(See ingredients below)"
        },
        {
          "ingredient": "2 tablespoons tomato paste"
        },
        {
          "ingredient": "3 tablespoons flour",
          "context": "(Wheat flour, plain flour and gluten-free flour blends all work!)"
        },
        {
          "ingredient": "2 cups vegetable broth"
        },
        {
          "ingredient": "Pinch of salt"
        },
        {
          "ingredient": "Pinch of cinnamon",
          "context": "(optional but recommended) "
        },
        {
          "ingredient": "1 teaspoon apple cider vinegar",
          "context": "(Or another vinegar type or lemon juice)"
        }
      ]
    },
    {
      "groupTitle": "Mexican spice mix",
      "ingredients": [
        {
          "ingredient": "Scant 1/2 tablespoon ground paprika"
        },
        {
          "ingredient": "Scant 1/2 tablespoon dried oregano"
        },
        {
          "ingredient": "1/4 teaspoon ground cumin"
        },
        {
          "ingredient": "Scant 1/8 teaspoon ground chili"
        }
      ]
    }
  ],
  "steps": [
    {
      "step": "Preheat the oven to 200C fan bake."
    },
    {
      "step": "Make the Bean mix as per its recipe instructions. Once it is simmering, start on the Enchilada sauce. Remember to give the beans a stir every now and then."
    },
    {
      "step": "Start by heating oil in a medium pot. Meanwhile prepare Mexican spice mix (mix all spices together), and vegetable broth as per packet instructions.",
      "title": "Enchilada sauce"
    },
    {
      "step": "Once oil has warmed add 1 tablespoon of the Mexican spice mix (save any extra for later to adjust the spice level to your liking) and cook for 30 seconds."
    },
    {
      "step": "Then add tomato paste and mix. Add some of the broth if it’s too dry.\n"
    },
    {
      "step": "Add some of the flour and some of the broth and mix until smooth. Repeat until all the flour and broth have been added."
    },
    {
      "step": "Next add the salt and cinnamon and stir. Simmer the sauce until it thickens slightly."
    },
    {
      "step": "Once thickened add the apple cider vinegar. Taste and add more Mexican spice mix if you would like it spicier.\n\nNext assemble the enchiladas!"
    },
    {
      "step": "Lightly grease a baking dish (20cm x 30cm or 2 square dishes) with oil.\nPour a quarter cup or so enchilada sauce into your prepared pan and tilt it from side to side until the bottom of the pan is evenly coated.",
      "title": "To assemble the enchiladas"
    },
    {
      "step": "To assemble your first enchilada, spread ½ cup filling mixture down the middle of a tortilla, then snugly wrap the left side over and then the right, to make a wrap. "
    },
    {
      "step": "Place it seam side down at one end of your pan. Repeat with remaining tortillas and filling. (There should be enough filling for 6 tortillas, but there might be a little bit left over which you can either add to the 6th tortilla or make a 7th with it)."
    },
    {
      "step": "Drizzle the enchilada sauce evenly over the enchiladas, leaving the tips of the enchiladas bare. "
    },
    {
      "step": "Sprinkle grated cheese evenly over the enchiladas. Bake, uncovered, on the middle rack for 20 minutes.\n"
    },
    {
      "step": "If the cheese on top isn’t golden enough for your liking, carefully transfer the enchiladas to the upper rack of the oven and bake for an additional 3 to 6 minutes, until sufficiently golden and bubbly."
    }
  ]
}
